Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025dak176.h
extern volatile __IPC12bits_t IPC12bits __asm__ ("IPC12") __attribute__((section("sfrs"), address(0xBF810200)));
extern volatile uint32_t        IPC12CLR __attribute__((section("sfrs"),address(0xBF810204)));
extern volatile uint32_t        IPC12SET __attribute__((section("sfrs"),address(0xBF810208)));
extern volatile uint32_t        IPC12INV __attribute__((section("sfrs"),address(0xBF81020C)));
#define IPC13 IPC13
extern volatile uint32_t   IPC13 __attribute__((section("sfrs"), address(0xBF810210)));
typedef union {
  struct {
    uint32_t ADCDF1IS:2;
    uint32_t ADCDF1IP:3;
    uint32_t :3;
    uint32_t ADCDF2IS:2;
    uint32_t ADCDF2IP:3;
    uint32_t :3;
    uint32_t ADCDF3IS:2;
    uint32_t ADCDF3IP:3;
    uint32_t :3;
    uint32_t ADCDF4IS:2;
    uint32_t ADCDF4IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC13bits_t;
extern volatile __IPC13bits_t IPC13bits __asm__ ("IPC13") __attribute__((section("sfrs"), address(0xBF810210)));
extern volatile uint32_t        IPC13CLR __attribute__((section("sfrs"),address(0xBF810214)));
extern volatile uint32_t        IPC13SET __attribute__((section("sfrs"),address(0xBF810218)));
extern volatile uint32_t        IPC13INV __attribute__((section("sfrs"),address(0xBF81021C)));
#define IPC14 IPC14
extern volatile uint32_t   IPC14 __attribute__((section("sfrs"), address(0xBF810220)));
typedef union {
  struct {
    uint32_t ADCDF5IS:2;
    uint32_t ADCDF5IP:3;
    uint32_t :3;
    uint32_t ADCDF6IS:2;
    uint32_t ADCDF6IP:3;
    uint32_t :3;
    uint32_t ADCFLTIS:2;
    uint32_t ADCFLTIP:3;
    uint32_t :3;
    uint32_t ADCD0IS:2;
    uint32_t ADCD0IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC14bits_t;
extern volatile __IPC14bits_t IPC14bits __asm__ ("IPC14") __attribute__((section("sfrs"), address(0xBF810220)));
extern volatile uint32_t        IPC14CLR __attribute__((section("sfrs"),address(0xBF810224)));
extern volatile uint32_t        IPC14SET __attribute__((section("sfrs"),address(0xBF810228)));
extern volatile uint32_t        IPC14INV __attribute__((section("sfrs"),address(0xBF81022C)));
#define IPC15 IPC15
extern volatile uint32_t   IPC15 __attribute__((section("sfrs"), address(0xBF810230)));
typedef union {
  struct {
    uint32_t ADCD1IS:2;
    uint32_t ADCD1IP:3;
    uint32_t :3;
    uint32_t ADCD2IS:2;
    uint32_t ADCD2IP:3;
    uint32_t :3;
    uint32_t ADCD3IS:2;
    uint32_t ADCD3IP:3;
    uint32_t :3;
    uint32_t ADCD4IS:2;
    uint32_t ADCD4IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC15bits_t;
extern volatile __IPC15bits_t IPC15bits __asm__ ("IPC15") __attribute__((section("sfrs"), address(0xBF810230)));
extern volatile uint32_t        IPC15CLR __attribute__((section("sfrs"),address(0xBF810234)));
extern volatile uint32_t        IPC15SET __attribute__((section("sfrs"),address(0xBF810238)));
extern volatile uint32_t        IPC15INV __attribute__((section("sfrs"),address(0xBF81023C)));
#define IPC16 IPC16
extern volatile uint32_t   IPC16 __attribute__((section("sfrs"), address(0xBF810240)));
typedef union {
  struct {
    uint32_t ADCD5IS:2;
    uint32_t ADCD5IP:3;
    uint32_t :3;
    uint32_t ADCD6IS:2;
    uint32_t ADCD6IP:3;
    uint32_t :3;
    uint32_t ADCD7IS:2;
    uint32_t ADCD7IP:3;
    uint32_t :3;
    uint32_t ADCD8IS:2;
    uint32_t ADCD8IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC16bits_t;
extern volatile __IPC16bits_t IPC16bits __asm__ ("IPC16") __attribute__((section("sfrs"), address(0xBF810240)));
extern volatile uint32_t        IPC16CLR __attribute__((section("sfrs"),address(0xBF810244)));
extern volatile uint32_t        IPC16SET __attribute__((section("sfrs"),address(0xBF810248)));
extern volatile uint32_t        IPC16INV __attribute__((section("sfrs"),address(0xBF81024C)));
#define IPC17 IPC17
extern volatile uint32_t   IPC17 __attribute__((section("sfrs"), address(0xBF810250)));
typedef union {
  struct {
    uint32_t ADCD9IS:2;
    uint32_t ADCD9IP:3;
    uint32_t :3;
    uint32_t ADCD10IS:2;
    uint32_t ADCD10IP:3;
    uint32_t :3;
    uint32_t ADCD11IS:2;
    uint32_t ADCD11IP:3;
    uint32_t :3;
    uint32_t ADCD12IS:2;
    uint32_t ADCD12IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC17bits_t;
extern volatile __IPC17bits_t IPC17bits __asm__ ("IPC17") __attribute__((section("sfrs"), address(0xBF810250)));
extern volatile uint32_t        IPC17CLR __attribute__((section("sfrs"),address(0xBF810254)));
extern volatile uint32_t        IPC17SET __attribute__((section("sfrs"),address(0xBF810258)));
extern volatile uint32_t        IPC17INV __attribute__((section("sfrs"),address(0xBF81025C)));
#define IPC18 IPC18
extern volatile uint32_t   IPC18 __attribute__((section("sfrs"), address(0xBF810260)));
typedef union {
  struct {
    uint32_t ADCD13IS:2;
    uint32_t ADCD13IP:3;
    uint32_t :3;
    uint32_t ADCD14IS:2;
    uint32_t ADCD14IP:3;
    uint32_t :3;
    uint32_t ADCD15IS:2;
    uint32_t ADCD15IP:3;
    uint32_t :3;
    uint32_t ADCD16IS:2;
    uint32_t ADCD16IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC18bits_t;
extern volatile __IPC18bits_t IPC18bits __asm__ ("IPC18") __attribute__((section("sfrs"), address(0xBF810260)));
extern volatile uint32_t        IPC18CLR __attribute__((section("sfrs"),address(0xBF810264)));
extern volatile uint32_t        IPC18SET __attribute__((section("sfrs"),address(0xBF810268)));
extern volatile uint32_t        IPC18INV __attribute__((section("sfrs"),address(0xBF81026C)));
#define IPC19 IPC19
extern volatile uint32_t   IPC19 __attribute__((section("sfrs"), address(0xBF810270)));
typedef union {
  struct {
    uint32_t ADCD17IS:2;
    uint32_t ADCD17IP:3;
    uint32_t :3;
    uint32_t ADCD18IS:2;
    uint32_t ADCD18IP:3;
    uint32_t :3;
    uint32_t ADCD19IS:2;
    uint32_t ADCD19IP:3;
    uint32_t :3;
    uint32_t ADCD20IS:2;
    uint32_t ADCD20IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC19bits_t;
extern volatile __IPC19bits_t IPC19bits __asm__ ("IPC19") __attribute__((section("sfrs"), address(0xBF810270)));
extern volatile uint32_t        IPC19CLR __attribute__((section("sfrs"),address(0xBF810274)));
extern volatile uint32_t        IPC19SET __attribute__((section("sfrs"),address(0xBF810278)));
extern volatile uint32_t        IPC19INV __attribute__((section("sfrs"),address(0xBF81027C)));
#define IPC20 IPC20
extern volatile uint32_t   IPC20 __attribute__((section("sfrs"), address(0xBF810280)));
typedef union {
  struct {
    uint32_t ADCD21IS:2;
    uint32_t ADCD21IP:3;
    uint32_t :3;
    uint32_t ADCD22IS:2;
    uint32_t ADCD22IP:3;
    uint32_t :3;
    uint32_t ADCD23IS:2;
    uint32_t ADCD23IP:3;
    uint32_t :3;
    uint32_t ADCD24IS:2;
    uint32_t ADCD24IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC20bits_t;
