Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025dak176.h
extern volatile __OC2CONbits_t OC2CONbits __asm__ ("OC2CON") __attribute__((section("sfrs"), address(0xBF844200)));
extern volatile uint32_t        OC2CONCLR __attribute__((section("sfrs"),address(0xBF844204)));
extern volatile uint32_t        OC2CONSET __attribute__((section("sfrs"),address(0xBF844208)));
extern volatile uint32_t        OC2CONINV __attribute__((section("sfrs"),address(0xBF84420C)));
#define OC2R OC2R
extern volatile uint32_t   OC2R __attribute__((section("sfrs"), address(0xBF844210)));
extern volatile uint32_t        OC2RCLR __attribute__((section("sfrs"),address(0xBF844214)));
extern volatile uint32_t        OC2RSET __attribute__((section("sfrs"),address(0xBF844218)));
extern volatile uint32_t        OC2RINV __attribute__((section("sfrs"),address(0xBF84421C)));
#define OC2RS OC2RS
extern volatile uint32_t   OC2RS __attribute__((section("sfrs"), address(0xBF844220)));
extern volatile uint32_t        OC2RSCLR __attribute__((section("sfrs"),address(0xBF844224)));
extern volatile uint32_t        OC2RSSET __attribute__((section("sfrs"),address(0xBF844228)));
extern volatile uint32_t        OC2RSINV __attribute__((section("sfrs"),address(0xBF84422C)));
#define OC3CON OC3CON
extern volatile uint32_t   OC3CON __attribute__((section("sfrs"), address(0xBF844400)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC3CONbits_t;
extern volatile __OC3CONbits_t OC3CONbits __asm__ ("OC3CON") __attribute__((section("sfrs"), address(0xBF844400)));
extern volatile uint32_t        OC3CONCLR __attribute__((section("sfrs"),address(0xBF844404)));
extern volatile uint32_t        OC3CONSET __attribute__((section("sfrs"),address(0xBF844408)));
extern volatile uint32_t        OC3CONINV __attribute__((section("sfrs"),address(0xBF84440C)));
#define OC3R OC3R
extern volatile uint32_t   OC3R __attribute__((section("sfrs"), address(0xBF844410)));
extern volatile uint32_t        OC3RCLR __attribute__((section("sfrs"),address(0xBF844414)));
extern volatile uint32_t        OC3RSET __attribute__((section("sfrs"),address(0xBF844418)));
extern volatile uint32_t        OC3RINV __attribute__((section("sfrs"),address(0xBF84441C)));
#define OC3RS OC3RS
extern volatile uint32_t   OC3RS __attribute__((section("sfrs"), address(0xBF844420)));
extern volatile uint32_t        OC3RSCLR __attribute__((section("sfrs"),address(0xBF844424)));
extern volatile uint32_t        OC3RSSET __attribute__((section("sfrs"),address(0xBF844428)));
extern volatile uint32_t        OC3RSINV __attribute__((section("sfrs"),address(0xBF84442C)));
#define OC4CON OC4CON
extern volatile uint32_t   OC4CON __attribute__((section("sfrs"), address(0xBF844600)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC4CONbits_t;
extern volatile __OC4CONbits_t OC4CONbits __asm__ ("OC4CON") __attribute__((section("sfrs"), address(0xBF844600)));
extern volatile uint32_t        OC4CONCLR __attribute__((section("sfrs"),address(0xBF844604)));
extern volatile uint32_t        OC4CONSET __attribute__((section("sfrs"),address(0xBF844608)));
extern volatile uint32_t        OC4CONINV __attribute__((section("sfrs"),address(0xBF84460C)));
#define OC4R OC4R
extern volatile uint32_t   OC4R __attribute__((section("sfrs"), address(0xBF844610)));
extern volatile uint32_t        OC4RCLR __attribute__((section("sfrs"),address(0xBF844614)));
extern volatile uint32_t        OC4RSET __attribute__((section("sfrs"),address(0xBF844618)));
extern volatile uint32_t        OC4RINV __attribute__((section("sfrs"),address(0xBF84461C)));
#define OC4RS OC4RS
extern volatile uint32_t   OC4RS __attribute__((section("sfrs"), address(0xBF844620)));
extern volatile uint32_t        OC4RSCLR __attribute__((section("sfrs"),address(0xBF844624)));
extern volatile uint32_t        OC4RSSET __attribute__((section("sfrs"),address(0xBF844628)));
extern volatile uint32_t        OC4RSINV __attribute__((section("sfrs"),address(0xBF84462C)));
#define OC5CON OC5CON
extern volatile uint32_t   OC5CON __attribute__((section("sfrs"), address(0xBF844800)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC5CONbits_t;
extern volatile __OC5CONbits_t OC5CONbits __asm__ ("OC5CON") __attribute__((section("sfrs"), address(0xBF844800)));
extern volatile uint32_t        OC5CONCLR __attribute__((section("sfrs"),address(0xBF844804)));
extern volatile uint32_t        OC5CONSET __attribute__((section("sfrs"),address(0xBF844808)));
extern volatile uint32_t        OC5CONINV __attribute__((section("sfrs"),address(0xBF84480C)));
#define OC5R OC5R
extern volatile uint32_t   OC5R __attribute__((section("sfrs"), address(0xBF844810)));
extern volatile uint32_t        OC5RCLR __attribute__((section("sfrs"),address(0xBF844814)));
extern volatile uint32_t        OC5RSET __attribute__((section("sfrs"),address(0xBF844818)));
extern volatile uint32_t        OC5RINV __attribute__((section("sfrs"),address(0xBF84481C)));
#define OC5RS OC5RS
extern volatile uint32_t   OC5RS __attribute__((section("sfrs"), address(0xBF844820)));
extern volatile uint32_t        OC5RSCLR __attribute__((section("sfrs"),address(0xBF844824)));
extern volatile uint32_t        OC5RSSET __attribute__((section("sfrs"),address(0xBF844828)));
extern volatile uint32_t        OC5RSINV __attribute__((section("sfrs"),address(0xBF84482C)));
#define OC6CON OC6CON
extern volatile uint32_t   OC6CON __attribute__((section("sfrs"), address(0xBF844A00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC6CONbits_t;
