Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025dak176.h
extern volatile __C2FIFOINT1bits_t C2FIFOINT1bits __asm__ ("C2FIFOINT1") __attribute__((section("sfrs"), address(0xBF8813A0)));
extern volatile uint32_t        C2FIFOINT1CLR __attribute__((section("sfrs"),address(0xBF8813A4)));
extern volatile uint32_t        C2FIFOINT1SET __attribute__((section("sfrs"),address(0xBF8813A8)));
extern volatile uint32_t        C2FIFOINT1INV __attribute__((section("sfrs"),address(0xBF8813AC)));
#define C2FIFOUA1 C2FIFOUA1
extern volatile uint32_t   C2FIFOUA1 __attribute__((section("sfrs"), address(0xBF8813B0)));
extern volatile uint32_t        C2FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF8813B4)));
extern volatile uint32_t        C2FIFOUA1SET __attribute__((section("sfrs"),address(0xBF8813B8)));
extern volatile uint32_t        C2FIFOUA1INV __attribute__((section("sfrs"),address(0xBF8813BC)));
#define C2FIFOCI1 C2FIFOCI1
extern volatile uint32_t   C2FIFOCI1 __attribute__((section("sfrs"), address(0xBF8813C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI1bits_t;
extern volatile __C2FIFOCI1bits_t C2FIFOCI1bits __asm__ ("C2FIFOCI1") __attribute__((section("sfrs"), address(0xBF8813C0)));
extern volatile uint32_t        C2FIFOCI1CLR __attribute__((section("sfrs"),address(0xBF8813C4)));
extern volatile uint32_t        C2FIFOCI1SET __attribute__((section("sfrs"),address(0xBF8813C8)));
extern volatile uint32_t        C2FIFOCI1INV __attribute__((section("sfrs"),address(0xBF8813CC)));
#define C2FIFOCON2 C2FIFOCON2
extern volatile uint32_t   C2FIFOCON2 __attribute__((section("sfrs"), address(0xBF8813D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON2bits_t;
extern volatile __C2FIFOCON2bits_t C2FIFOCON2bits __asm__ ("C2FIFOCON2") __attribute__((section("sfrs"), address(0xBF8813D0)));
extern volatile uint32_t        C2FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8813D4)));
extern volatile uint32_t        C2FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8813D8)));
extern volatile uint32_t        C2FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8813DC)));
#define C2FIFOINT2 C2FIFOINT2
extern volatile uint32_t   C2FIFOINT2 __attribute__((section("sfrs"), address(0xBF8813E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT2bits_t;
extern volatile __C2FIFOINT2bits_t C2FIFOINT2bits __asm__ ("C2FIFOINT2") __attribute__((section("sfrs"), address(0xBF8813E0)));
extern volatile uint32_t        C2FIFOINT2CLR __attribute__((section("sfrs"),address(0xBF8813E4)));
extern volatile uint32_t        C2FIFOINT2SET __attribute__((section("sfrs"),address(0xBF8813E8)));
extern volatile uint32_t        C2FIFOINT2INV __attribute__((section("sfrs"),address(0xBF8813EC)));
#define C2FIFOUA2 C2FIFOUA2
extern volatile uint32_t   C2FIFOUA2 __attribute__((section("sfrs"), address(0xBF8813F0)));
extern volatile uint32_t        C2FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8813F4)));
extern volatile uint32_t        C2FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8813F8)));
extern volatile uint32_t        C2FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8813FC)));
#define C2FIFOCI2 C2FIFOCI2
extern volatile uint32_t   C2FIFOCI2 __attribute__((section("sfrs"), address(0xBF881400)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI2bits_t;
extern volatile __C2FIFOCI2bits_t C2FIFOCI2bits __asm__ ("C2FIFOCI2") __attribute__((section("sfrs"), address(0xBF881400)));
extern volatile uint32_t        C2FIFOCI2CLR __attribute__((section("sfrs"),address(0xBF881404)));
extern volatile uint32_t        C2FIFOCI2SET __attribute__((section("sfrs"),address(0xBF881408)));
extern volatile uint32_t        C2FIFOCI2INV __attribute__((section("sfrs"),address(0xBF88140C)));
#define C2FIFOCON3 C2FIFOCON3
extern volatile uint32_t   C2FIFOCON3 __attribute__((section("sfrs"), address(0xBF881410)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON3bits_t;
extern volatile __C2FIFOCON3bits_t C2FIFOCON3bits __asm__ ("C2FIFOCON3") __attribute__((section("sfrs"), address(0xBF881410)));
extern volatile uint32_t        C2FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF881414)));
extern volatile uint32_t        C2FIFOCON3SET __attribute__((section("sfrs"),address(0xBF881418)));
extern volatile uint32_t        C2FIFOCON3INV __attribute__((section("sfrs"),address(0xBF88141C)));
#define C2FIFOINT3 C2FIFOINT3
extern volatile uint32_t   C2FIFOINT3 __attribute__((section("sfrs"), address(0xBF881420)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT3bits_t;
extern volatile __C2FIFOINT3bits_t C2FIFOINT3bits __asm__ ("C2FIFOINT3") __attribute__((section("sfrs"), address(0xBF881420)));
extern volatile uint32_t        C2FIFOINT3CLR __attribute__((section("sfrs"),address(0xBF881424)));
extern volatile uint32_t        C2FIFOINT3SET __attribute__((section("sfrs"),address(0xBF881428)));
extern volatile uint32_t        C2FIFOINT3INV __attribute__((section("sfrs"),address(0xBF88142C)));
#define C2FIFOUA3 C2FIFOUA3
extern volatile uint32_t   C2FIFOUA3 __attribute__((section("sfrs"), address(0xBF881430)));
extern volatile uint32_t        C2FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF881434)));
extern volatile uint32_t        C2FIFOUA3SET __attribute__((section("sfrs"),address(0xBF881438)));
extern volatile uint32_t        C2FIFOUA3INV __attribute__((section("sfrs"),address(0xBF88143C)));
#define C2FIFOCI3 C2FIFOCI3
extern volatile uint32_t   C2FIFOCI3 __attribute__((section("sfrs"), address(0xBF881440)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI3bits_t;
