Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025dak176.h
#define _GLCDCURDATA13_PIXEL315_POSITION         0x00000000
#define _GLCDCURDATA13_PIXEL315_MASK             0x0000000F
#define _GLCDCURDATA13_PIXEL315_LENGTH           0x00000004

#define _GLCDCURDATA13_PIXEL314_POSITION         0x00000004
#define _GLCDCURDATA13_PIXEL314_MASK             0x000000F0
#define _GLCDCURDATA13_PIXEL314_LENGTH           0x00000004

#define _GLCDCURDATA13_PIXEL313_POSITION         0x00000008
#define _GLCDCURDATA13_PIXEL313_MASK             0x00000F00
#define _GLCDCURDATA13_PIXEL313_LENGTH           0x00000004

#define _GLCDCURDATA13_PIXEL312_POSITION         0x0000000C
#define _GLCDCURDATA13_PIXEL312_MASK             0x0000F000
#define _GLCDCURDATA13_PIXEL312_LENGTH           0x00000004

#define _GLCDCURDATA13_PIXEL311_POSITION         0x00000010
#define _GLCDCURDATA13_PIXEL311_MASK             0x000F0000
#define _GLCDCURDATA13_PIXEL311_LENGTH           0x00000004

#define _GLCDCURDATA13_PIXEL310_POSITION         0x00000014
#define _GLCDCURDATA13_PIXEL310_MASK             0x00F00000
#define _GLCDCURDATA13_PIXEL310_LENGTH           0x00000004

#define _GLCDCURDATA13_PIXEL39_POSITION          0x00000018
#define _GLCDCURDATA13_PIXEL39_MASK              0x0F000000
#define _GLCDCURDATA13_PIXEL39_LENGTH            0x00000004

#define _GLCDCURDATA13_PIXEL38_POSITION          0x0000001C
#define _GLCDCURDATA13_PIXEL38_MASK              0xF0000000
#define _GLCDCURDATA13_PIXEL38_LENGTH            0x00000004

#define _GLCDCURDATA14_PIXEL323_POSITION         0x00000000
#define _GLCDCURDATA14_PIXEL323_MASK             0x0000000F
#define _GLCDCURDATA14_PIXEL323_LENGTH           0x00000004

#define _GLCDCURDATA14_PIXEL322_POSITION         0x00000004
#define _GLCDCURDATA14_PIXEL322_MASK             0x000000F0
#define _GLCDCURDATA14_PIXEL322_LENGTH           0x00000004

#define _GLCDCURDATA14_PIXEL321_POSITION         0x00000008
#define _GLCDCURDATA14_PIXEL321_MASK             0x00000F00
#define _GLCDCURDATA14_PIXEL321_LENGTH           0x00000004

#define _GLCDCURDATA14_PIXEL320_POSITION         0x0000000C
#define _GLCDCURDATA14_PIXEL320_MASK             0x0000F000
#define _GLCDCURDATA14_PIXEL320_LENGTH           0x00000004

#define _GLCDCURDATA14_PIXEL319_POSITION         0x00000010
#define _GLCDCURDATA14_PIXEL319_MASK             0x000F0000
#define _GLCDCURDATA14_PIXEL319_LENGTH           0x00000004

#define _GLCDCURDATA14_PIXEL318_POSITION         0x00000014
#define _GLCDCURDATA14_PIXEL318_MASK             0x00F00000
#define _GLCDCURDATA14_PIXEL318_LENGTH           0x00000004

#define _GLCDCURDATA14_PIXEL317_POSITION         0x00000018
#define _GLCDCURDATA14_PIXEL317_MASK             0x0F000000
#define _GLCDCURDATA14_PIXEL317_LENGTH           0x00000004

#define _GLCDCURDATA14_PIXEL316_POSITION         0x0000001C
#define _GLCDCURDATA14_PIXEL316_MASK             0xF0000000
#define _GLCDCURDATA14_PIXEL316_LENGTH           0x00000004

#define _GLCDCURDATA15_PIXEL331_POSITION         0x00000000
#define _GLCDCURDATA15_PIXEL331_MASK             0x0000000F
#define _GLCDCURDATA15_PIXEL331_LENGTH           0x00000004

#define _GLCDCURDATA15_PIXEL330_POSITION         0x00000004
#define _GLCDCURDATA15_PIXEL330_MASK             0x000000F0
#define _GLCDCURDATA15_PIXEL330_LENGTH           0x00000004

#define _GLCDCURDATA15_PIXEL329_POSITION         0x00000008
#define _GLCDCURDATA15_PIXEL329_MASK             0x00000F00
#define _GLCDCURDATA15_PIXEL329_LENGTH           0x00000004

#define _GLCDCURDATA15_PIXEL328_POSITION         0x0000000C
#define _GLCDCURDATA15_PIXEL328_MASK             0x0000F000
#define _GLCDCURDATA15_PIXEL328_LENGTH           0x00000004

#define _GLCDCURDATA15_PIXEL327_POSITION         0x00000010
#define _GLCDCURDATA15_PIXEL327_MASK             0x000F0000
#define _GLCDCURDATA15_PIXEL327_LENGTH           0x00000004

#define _GLCDCURDATA15_PIXEL326_POSITION         0x00000014
#define _GLCDCURDATA15_PIXEL326_MASK             0x00F00000
#define _GLCDCURDATA15_PIXEL326_LENGTH           0x00000004

#define _GLCDCURDATA15_PIXEL325_POSITION         0x00000018
#define _GLCDCURDATA15_PIXEL325_MASK             0x0F000000
#define _GLCDCURDATA15_PIXEL325_LENGTH           0x00000004

#define _GLCDCURDATA15_PIXEL324_POSITION         0x0000001C
#define _GLCDCURDATA15_PIXEL324_MASK             0xF0000000
#define _GLCDCURDATA15_PIXEL324_LENGTH           0x00000004

#define _GLCDCURDATA16_PIXEL47_POSITION          0x00000000
#define _GLCDCURDATA16_PIXEL47_MASK              0x0000000F
#define _GLCDCURDATA16_PIXEL47_LENGTH            0x00000004

#define _GLCDCURDATA16_PIXEL46_POSITION          0x00000004
#define _GLCDCURDATA16_PIXEL46_MASK              0x000000F0
#define _GLCDCURDATA16_PIXEL46_LENGTH            0x00000004

#define _GLCDCURDATA16_PIXEL45_POSITION          0x00000008
#define _GLCDCURDATA16_PIXEL45_MASK              0x00000F00
#define _GLCDCURDATA16_PIXEL45_LENGTH            0x00000004

#define _GLCDCURDATA16_PIXEL44_POSITION          0x0000000C
#define _GLCDCURDATA16_PIXEL44_MASK              0x0000F000
#define _GLCDCURDATA16_PIXEL44_LENGTH            0x00000004

#define _GLCDCURDATA16_PIXEL43_POSITION          0x00000010
#define _GLCDCURDATA16_PIXEL43_MASK              0x000F0000
#define _GLCDCURDATA16_PIXEL43_LENGTH            0x00000004

#define _GLCDCURDATA16_PIXEL42_POSITION          0x00000014
#define _GLCDCURDATA16_PIXEL42_MASK              0x00F00000
#define _GLCDCURDATA16_PIXEL42_LENGTH            0x00000004

#define _GLCDCURDATA16_PIXEL41_POSITION          0x00000018
#define _GLCDCURDATA16_PIXEL41_MASK              0x0F000000
#define _GLCDCURDATA16_PIXEL41_LENGTH            0x00000004

#define _GLCDCURDATA16_PIXEL40_POSITION          0x0000001C
#define _GLCDCURDATA16_PIXEL40_MASK              0xF0000000
#define _GLCDCURDATA16_PIXEL40_LENGTH            0x00000004

#define _GLCDCURDATA17_PIXEL415_POSITION         0x00000000
#define _GLCDCURDATA17_PIXEL415_MASK             0x0000000F
#define _GLCDCURDATA17_PIXEL415_LENGTH           0x00000004

#define _GLCDCURDATA17_PIXEL414_POSITION         0x00000004
#define _GLCDCURDATA17_PIXEL414_MASK             0x000000F0
#define _GLCDCURDATA17_PIXEL414_LENGTH           0x00000004

#define _GLCDCURDATA17_PIXEL413_POSITION         0x00000008
#define _GLCDCURDATA17_PIXEL413_MASK             0x00000F00
#define _GLCDCURDATA17_PIXEL413_LENGTH           0x00000004

#define _GLCDCURDATA17_PIXEL412_POSITION         0x0000000C
#define _GLCDCURDATA17_PIXEL412_MASK             0x0000F000
#define _GLCDCURDATA17_PIXEL412_LENGTH           0x00000004

